MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx764f128h.h
extern volatile __C1FLTCON3bits_t C1FLTCON3bits __asm__ ("C1FLTCON3") __attribute__((section("sfrs"), address(0xBF88B0F0)));
extern volatile uint32_t        C1FLTCON3CLR __attribute__((section("sfrs"),address(0xBF88B0F4)));
extern volatile uint32_t        C1FLTCON3SET __attribute__((section("sfrs"),address(0xBF88B0F8)));
extern volatile uint32_t        C1FLTCON3INV __attribute__((section("sfrs"),address(0xBF88B0FC)));
#define C1FLTCON4 C1FLTCON4
extern volatile uint32_t   C1FLTCON4 __attribute__((section("sfrs"), address(0xBF88B100)));
typedef union {
  struct {
    uint32_t FSEL16:5;
    uint32_t MSEL16:2;
    uint32_t FLTEN16:1;
    uint32_t FSEL17:5;
    uint32_t MSEL17:2;
    uint32_t FLTEN17:1;
    uint32_t FSEL18:5;
    uint32_t MSEL18:2;
    uint32_t FLTEN18:1;
    uint32_t FSEL19:5;
    uint32_t MSEL19:2;
    uint32_t FLTEN19:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FLTCON4bits_t;
extern volatile __C1FLTCON4bits_t C1FLTCON4bits __asm__ ("C1FLTCON4") __attribute__((section("sfrs"), address(0xBF88B100)));
extern volatile uint32_t        C1FLTCON4CLR __attribute__((section("sfrs"),address(0xBF88B104)));
extern volatile uint32_t        C1FLTCON4SET __attribute__((section("sfrs"),address(0xBF88B108)));
extern volatile uint32_t        C1FLTCON4INV __attribute__((section("sfrs"),address(0xBF88B10C)));
#define C1FLTCON5 C1FLTCON5
extern volatile uint32_t   C1FLTCON5 __attribute__((section("sfrs"), address(0xBF88B110)));
typedef union {
  struct {
    uint32_t FSEL20:5;
    uint32_t MSEL20:2;
    uint32_t FLTEN20:1;
    uint32_t FSEL21:5;
    uint32_t MSEL21:2;
    uint32_t FLTEN21:1;
    uint32_t FSEL22:5;
    uint32_t MSEL22:2;
    uint32_t FLTEN22:1;
    uint32_t FSEL23:5;
    uint32_t MSEL23:2;
    uint32_t FLTEN23:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FLTCON5bits_t;
extern volatile __C1FLTCON5bits_t C1FLTCON5bits __asm__ ("C1FLTCON5") __attribute__((section("sfrs"), address(0xBF88B110)));
extern volatile uint32_t        C1FLTCON5CLR __attribute__((section("sfrs"),address(0xBF88B114)));
extern volatile uint32_t        C1FLTCON5SET __attribute__((section("sfrs"),address(0xBF88B118)));
extern volatile uint32_t        C1FLTCON5INV __attribute__((section("sfrs"),address(0xBF88B11C)));
#define C1FLTCON6 C1FLTCON6
extern volatile uint32_t   C1FLTCON6 __attribute__((section("sfrs"), address(0xBF88B120)));
typedef union {
  struct {
    uint32_t FSEL24:5;
    uint32_t MSEL24:2;
    uint32_t FLTEN24:1;
    uint32_t FSEL25:5;
    uint32_t MSEL25:2;
    uint32_t FLTEN25:1;
    uint32_t FSEL26:5;
    uint32_t MSEL26:2;
    uint32_t FLTEN26:1;
    uint32_t FSEL27:5;
    uint32_t MSEL27:2;
    uint32_t FLTEN27:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FLTCON6bits_t;
extern volatile __C1FLTCON6bits_t C1FLTCON6bits __asm__ ("C1FLTCON6") __attribute__((section("sfrs"), address(0xBF88B120)));
extern volatile uint32_t        C1FLTCON6CLR __attribute__((section("sfrs"),address(0xBF88B124)));
extern volatile uint32_t        C1FLTCON6SET __attribute__((section("sfrs"),address(0xBF88B128)));
extern volatile uint32_t        C1FLTCON6INV __attribute__((section("sfrs"),address(0xBF88B12C)));
#define C1FLTCON7 C1FLTCON7
extern volatile uint32_t   C1FLTCON7 __attribute__((section("sfrs"), address(0xBF88B130)));
typedef union {
  struct {
    uint32_t FSEL28:5;
    uint32_t MSEL28:2;
    uint32_t FLTEN28:1;
    uint32_t FSEL29:5;
    uint32_t MSEL29:2;
    uint32_t FLTEN29:1;
    uint32_t FSEL30:5;
    uint32_t MSEL30:2;
    uint32_t FLTEN30:1;
    uint32_t FSEL31:5;
    uint32_t MSEL31:2;
    uint32_t FLTEN31:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FLTCON7bits_t;
extern volatile __C1FLTCON7bits_t C1FLTCON7bits __asm__ ("C1FLTCON7") __attribute__((section("sfrs"), address(0xBF88B130)));
extern volatile uint32_t        C1FLTCON7CLR __attribute__((section("sfrs"),address(0xBF88B134)));
extern volatile uint32_t        C1FLTCON7SET __attribute__((section("sfrs"),address(0xBF88B138)));
extern volatile uint32_t        C1FLTCON7INV __attribute__((section("sfrs"),address(0xBF88B13C)));
#define C1RXF0 C1RXF0
extern volatile uint32_t   C1RXF0 __attribute__((section("sfrs"), address(0xBF88B140)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF0bits_t;
extern volatile __C1RXF0bits_t C1RXF0bits __asm__ ("C1RXF0") __attribute__((section("sfrs"), address(0xBF88B140)));
extern volatile uint32_t        C1RXF0CLR __attribute__((section("sfrs"),address(0xBF88B144)));
extern volatile uint32_t        C1RXF0SET __attribute__((section("sfrs"),address(0xBF88B148)));
extern volatile uint32_t        C1RXF0INV __attribute__((section("sfrs"),address(0xBF88B14C)));
#define C1RXF1 C1RXF1
extern volatile uint32_t   C1RXF1 __attribute__((section("sfrs"), address(0xBF88B150)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF1bits_t;
extern volatile __C1RXF1bits_t C1RXF1bits __asm__ ("C1RXF1") __attribute__((section("sfrs"), address(0xBF88B150)));
extern volatile uint32_t        C1RXF1CLR __attribute__((section("sfrs"),address(0xBF88B154)));
extern volatile uint32_t        C1RXF1SET __attribute__((section("sfrs"),address(0xBF88B158)));
extern volatile uint32_t        C1RXF1INV __attribute__((section("sfrs"),address(0xBF88B15C)));
#define C1RXF2 C1RXF2
extern volatile uint32_t   C1RXF2 __attribute__((section("sfrs"), address(0xBF88B160)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF2bits_t;
extern volatile __C1RXF2bits_t C1RXF2bits __asm__ ("C1RXF2") __attribute__((section("sfrs"), address(0xBF88B160)));
extern volatile uint32_t        C1RXF2CLR __attribute__((section("sfrs"),address(0xBF88B164)));
extern volatile uint32_t        C1RXF2SET __attribute__((section("sfrs"),address(0xBF88B168)));
extern volatile uint32_t        C1RXF2INV __attribute__((section("sfrs"),address(0xBF88B16C)));
#define C1RXF3 C1RXF3
extern volatile uint32_t   C1RXF3 __attribute__((section("sfrs"), address(0xBF88B170)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF3bits_t;
